Case III/S6/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v4.x                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0.0 0.0 0.0)				//0
	(1512.0 0.0 0.0) 		 	//1
	(1069.1455 1069.1455 0.0) 		//2
	(0.0 1512.0 0.0) 		 	//3
	(-1069.1455 1069.1455 0.0) 		//4
	(-1512.0 0.0 0) 		 	//5
	(-1069.1455 -1069.1455 0.0) 	//6
	(0.0 -1512.0 0.0) 		 	//7
	(1069.1455 -1069.1455 0.0) 		//8
	(504.0 0.0 0.0)				//9
	(504.0 504.0 0.0)			//10
	(0.0 504.0 0.0)				//11
	(-504.0 504.0 0.0)			//12
	(-504.0 0.0 0.0)			//13
	(-504.0 -504.0 0.0)			//14
	(0.0 -504.0 0.0)			//15
	(504.0 -504.0 0.0)			//16
	(0.0 0.0 630.0)				//17	
	(1512.0 0.0 630.0) 		 	//18
	(1069.1455 1069.1455 630.0) 	//19
	(0.0 1512.0 630.0) 		 	//20
	(-1069.1455 1069.1455 630.0) 	//21
	(-1512.0 0.0 630.0) 		 	//22
	(-1069.1455 -1069.1455 630.0) 	//23
	(0.0 -1512.0 630.0) 		 	//24
	(1069.1455 -1069.1455 630.0) 	//25
	(504.0 0.0 630.0)			//26
	(504.0 504.0 630.0)			//27
	(0.0 504.0 630.0)			//28
	(-504.0 504.0 630.0)			//29
	(-504.0 0.0 630.0)			//30
	(-504.0 -504.0 630.0)			//31
	(0.0 -504.0 630.0)			//32
	(504.0 -504.0 630.0)			//33


);

blocks
(
	 hex ( 0 9 10 11 17 26 27 28 ) ( 42 42 21 ) simpleGrading ( 1 1 3 )				//0
	 hex ( 15 16 9 0 32 33 26 17 ) ( 42 42 21 ) simpleGrading ( 1 1 3 )				//1
	 hex ( 13 0 11 12 30 17 28 29 ) ( 42 42 21 ) simpleGrading ( 1 1 3 )				//2
	 hex ( 14 15 0 13 31 32 17 30 ) ( 42 42 21 ) simpleGrading ( 1 1 3 )				//3
	 hex ( 9 1 2 10 26 18 19 27 ) ( 20 42 21 ) simpleGrading ( 8 1 3 ) 				//4
	 hex ( 16 8 1 9 33 25 18 26 ) ( 20 42 21 ) simpleGrading ( 8 1 3 )				//5
	 hex ( 5 13 12 4 22 30 29 21 ) ( 20 42 21 ) simpleGrading ( 0.125 1 3 )				//6	
	 hex ( 6 14 13 5 23 31 30 22 ) ( 20 42 21 ) simpleGrading ( 0.125 1 3 )				//7
	 hex ( 11 10 2 3 28 27 19 20 ) ( 42 20 21 ) simpleGrading ( 1 8 3 )				//8
	 hex ( 12 11 3 4 29 28 20 21 ) ( 42 20 21 ) simpleGrading ( 1 8 3 )				//9
	 hex ( 7 8 16 15 24 25 33 32 ) ( 42 20 21 ) simpleGrading ( 1 0.125 3 ) 				//10
	 hex ( 6 7 15 14 23 24 32 31 ) ( 42 20 21 ) simpleGrading ( 1 0.125 3 )				//11
);

edges
(
	 arc 1 2	( 1396.90586 578.61734 0.0 )
	 arc 2 3	( 578.61734 1396.90586 0.0 )
	 arc 3 4	( -578.61734 1396.90586 0.0 )
	 arc 4 5	( -1396.90586 578.61734 0.0 )
	 arc 5 6 	( -1396.90586 -578.61734 0.0 )
	 arc 6 7	( -578.61734 -1396.90586 0.0 )
	 arc 7 8	( 578.61734 -1396.90586 0.0 )
	 arc 8 1	( 1396.90586 -578.61734 0.0 )
	 arc 18 19	( 1396.90586 578.61734 630.0 )
	 arc 19 20	( 578.61734 1396.90586 630.0 )
	 arc 20 21	( -578.61734 1396.90586 630.0 )
	 arc 21 22	( -1396.90586 578.61734 630.0 )
	 arc 22 23 	( -1396.90586 -578.61734 630.0 )
	 arc 23 24	( -578.61734 -1396.90586 630.0 )
	 arc 24 25	( 578.61734 -1396.90586 630.0 )
	 arc 25 18	( 1396.90586 -578.61734 630.0 )
);

boundary
(
	down
	{
		type wall;
		faces
		(
			( 0 9 10 11 )
			( 0 9 16 15 )
			( 0 13 12 11 )
			( 0 13 14 15 )
			( 9 1 2 10 )
			( 9 1 8 16 )
			( 13 5 4 12 )
			( 13 5 6 14 )
			( 11 3 2 10 )
			( 11 3 4 12 )
			( 15 7 8 16 )
			( 15 7 6 14 )
		);
	}

	up
	{
		type slip;
		faces
		(
			( 17 26 27 28 )
			( 17 26 33 32 )
			( 17 30 29 28 )
			( 17 30 31 32 )
			( 26 18 19 27 )
			( 26 18 25 33 )
			( 30 22 21 29 )
			( 30 22 23 31 )
			( 28 20 19 27 )
			( 28 20 21 29 )
			( 32 24 25 33 )
			( 32 24 23 31 )
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 8 7 25 24 )
			( 7 6 24 23 )
			( 6 5 23 22 )
			( 5 4 22 21 )
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 8 1 25 18 )
			( 1 2 18 19 )
			( 2 3 19 20 )
			( 3 4 20 21 )
		);
	}
);

mergPatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
